experiment-finetuned/all_finetuned/runs/forwardStep/3/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // Block 0 - upstream region
    (0    0    0)   // 0
    (1    0    0)   // 1
    (1    0.5  0)   // 2
    (0    0.5  0)   // 3

    // Block 1 - downstream region
    (1    0    0)   // 4 = vertex 1
    (2    0    0)   // 5
    (2    0.5  0)   // 6
    (1    0.5  0)   // 7 = vertex 2

    // Block 2 - obstacle region
    (0    0.5  0)   // 8 = vertex 3
    (1    0.5  0)   // 9 = vertex 2
    (1    1    0)   // 10
    (0    1    0)   // 11

    // Block 3 - downstream obstacle region
    (1    0.5  0)   // 12 = vertex 2
    (2    0.5  0)   // 13
    (2    1    0)   // 14
    (1    1    0)   // 15 = vertex 10
);

blocks
(
    hex (0 1 2 3 0 1 2 3) (10 5 1) simpleGrading (1 1 1)
    hex (4 5 6 7 4 5 6 7) (10 5 1) simpleGrading (1 1 1)
    hex (8 9 10 11 8 9 10 11) (10 5 1) simpleGrading (1 1 1)
    hex (12 13 14 15 12 13 14 15) (10 5 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 6 7 4)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (11 10 6 5)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (8 9 10 11)
            (12 13 14 15)
        );
    }
    defaultFaces
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (8 9 10 11)
            (12 13 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //